
# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'grep'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Installing brew cask
#tap 'homebrew/cask-cask'

# Installing packages
brew 'awscli'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'cask'
brew 'curl'
brew 'git-crypt'
brew 'graphviz'
brew 'mackup'
brew 'mysql@5.7', restart_service: true, link: true, conflicts_with: ['mysql']
brew 'node'
brew 'nvm'
brew 'p7zip'
brew 'ssh-copy-id'
brew 'tree'
brew 'watch'
brew 'wget'

# Tapping cask repos
tap 'AdoptOpenJDK/openjdk'

# Installing cask apps
cask 'adoptopenjdk8'
cask 'docker'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'intellij-idea'
cask 'iterm2'
cask 'mysqlworkbench'
cask 'slack'
cask 'virtualbox'
cask 'visual-studio-code'

# Installing apps with dependencies on cask apps
brew 'sbt'
brew 'scala'

# Installing fonts
tap 'homebrew/cask-fonts'
cask 'font-clear-sans'
cask 'font-consolas-for-powerline'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-liberation-mono-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-roboto'
